In [39]:
import pandas as pd
import numpy as np

# 创建示例 DataFrame
df1 = pd.DataFrame({
    '日期': ['2022-01-01', '2022-01-02', '2022-01-03', '2022-01-04'],
    '销售额': [1000, 1500, 800, 1200],
    '销售人员': ['Alice', 'Bob', 'Charlie', 'David'],
    '城市': ['New York', 'San Francisco', 'New York', 'San Francisco']
})
df1 = df1.rename(index={
    0: '38H9',
    1: 'W9F1',
    2: 'KD82',
    3: '004U'
})
df1

              日期   销售额     销售人员             城市
38H9  2022-01-01  1000    Alice       New York
W9F1  2022-01-02  1500      Bob  San Francisco
KD82  2022-01-03   800  Charlie       New York
004U  2022-01-04  1200    David  San Francisco

In [41]:
# df1.to_csv("cleaned_sales_data.csv")
df1.to_csv("./cleaned.csv",encoding="utf-8")

In [43]:
cleaned_df = pd.read_csv("./cleaned.csv")
cleaned_df

  Unnamed: 0          日期   销售额     销售人员             城市
0       38H9  2022-01-01  1000    Alice       New York
1       W9F1  2022-01-02  1500      Bob  San Francisco
2       KD82  2022-01-03   800  Charlie       New York
3       004U  2022-01-04  1200    David  San Francisco

In [45]:
cleaned_df.rename(columns = {"Unnamed: 0":"ID"}, inplace=True)
cleaned_df

     ID          日期   销售额     销售人员             城市
0  38H9  2022-01-01  1000    Alice       New York
1  W9F1  2022-01-02  1500      Bob  San Francisco
2  KD82  2022-01-03   800  Charlie       New York
3  004U  2022-01-04  1200    David  San Francisco

In [47]:
cleaned_df.set_index("ID", inplace=True)
cleaned_df

              日期   销售额     销售人员             城市
ID
38H9  2022-01-01  1000    Alice       New York
W9F1  2022-01-02  1500      Bob  San Francisco
KD82  2022-01-03   800  Charlie       New York
004U  2022-01-04  1200    David  San Francisco

In [53]:
df1.to_csv("./cleaned_2.csv", index=False ,encoding="utf-8-sig")

In [55]:
cleaned_df_without_index = pd.read_csv("./cleaned_2.csv")
cleaned_df_without_index

           日期   销售额     销售人员             城市
0  2022-01-01  1000    Alice       New York
1  2022-01-02  1500      Bob  San Francisco
2  2022-01-03   800  Charlie       New York
3  2022-01-04  1200    David  San Francisco